package com.card.myapplication

data class Items(
    val name: String,
    val desc: String,
    val index: Int,
)

 val listItems = arrayListOf<Items>(
     Items("写入标签","选择文件写入标签",0),
     Items("获取标签文件列表","选择文件写入标签",0),
     Items("读取指定文件","选择文件写入标签",0),
     Items("删除指定文件","选择文件写入标签",0),
     Items("获取标签信息","选择文件写入标签",0),
     Items("获取标签版本","选择文件写入标签",0),
     Items("清空标签","选择文件写入标签",0),
     Items("更新屏幕","选择文件写入标签",0),
     Items("写入履历信息","选择文件写入标签",0),
     Items("获取履历信息","选择文件写入标签",0),
     Items("获取指令类型信息","选择文件写入标签",0),
     Items("获取指定文件大小","选择文件写入标签",0),
     Items("写入一条码加注记录","选择文件写入标签",0),
     Items("写入一条装备列表","选择文件写入标签",0),
     Items("写入一条设备更换记录","选择文件写入标签",0),
     Items("写入一条启油封记录","选择文件写入标签",0),
     Items("写入一条技术通报记录","选择文件写入标签",0),
     Items("写入一条软件变更记录","选择文件写入标签",0),
     Items("写入一条修理记录","选择文件写入标签",0),
     Items("写入一条通电时间记录","选择文件写入标签",0),
     Items("写入一条重要记事","选择文件写入标签",0),
     Items("写入一条调拨记录","选择文件写入标签",0),
     Items("写入一条挂机值班记录","选择文件写入标签",0),
 )
